from math import *
def bisection(f,a,b,ex,ef):
    """
    f:  είναι η συνάρτηση της οποίας θέλουμε να υπολογίσουμε την ρίζα,
        η f δίνεται ως lambda x: και ακολουθεί η συνάρτηση
    a:  είναι το κάτω όριο του διαστήματος
    b:  είναι το πάνω όριο του διαστήματος
    ex: είναι το μέγιστο επιτρεπτό σφάλμα στη θέση της ρίζας
    ef: είναι η μέγιστη επιτρεπτή απόλυτη τιμή της συνάρτησης στο σημείο που επιστρέφεται ως εκτίμηση της ρίζας

    ΠΑΡΑΔΕΙΓΜΑ για τον υπολογισμό ρίζας της συνάρτησης x^3-6x^2-x+30 στο διάστημα [1,4]
    με μέγιστο επιτρεπτό σφάλμα στη θέση της ρίζας: 0.000001 και
    μέγιστη επιτρεπτή απόλυτη τιμή της συνάρτησης στο σημείο που επιστρέφεται ως εκτίμηση της ρίζας: 0.000001
    
    bisection(lambda x: x**3-6*x**2-x+30, 1, 4, 1e-06, 1e-06)
    """    
    
    m=(a+b)/2
    n=1
      
    print('n\ta\tb\tm\tf(a)\tf(b)\tf(m)')
    s=str(n)+'\t'+str(round(a,4))+'\t'+str(round(b,4))+'\t'+str(round(m,4))+'\t'+str(round(f(a),4))+'\t'+str(round(f(b),4))+'\t'+str(round(f(m),4))
    print(s)
    while (b-a)/2>ex and abs(f(m))>ef:
        n+=1
        if f(m)*f(a)<0:
            b=m
        elif f(m)*f(b)<0:
            a=m
        m=(a+b)/2
        s=str(n)+'\t'+str(round(a,4))+'\t'+str(round(b,4))+'\t'+str(round(m,4))+'\t'+str(round(f(a),4))+'\t'+str(round(f(b),4))+'\t'+str(round(f(m),4))
        print(s)
    print('Εκτίμηση για την ρίζα:',m)
    

